АлогистикТест2/src/Documents/алк_СортировкаЛесопродукции/алк_СортировкаЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СортировкаЛесопродукции</name>
  <registerRecords>AccumulationRegister.алк_СортировкаЛесопродукции</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.рфп_ОтгрузкаВагона</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пиловочник</name>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаРасчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрВершиныФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрВершиныРасчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычетНаКору</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_СортировкаЛесопродукции/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры


 
 
 
#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ИмяФайлаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораФайла(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//РежимДиалога = ?(РежимВыгрузки, РежимДиалогаВыбораФайла.Сохранение, РежимДиалогаВыбораФайла.Открытие);
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Выберите файл с данными сортировки'");
	//ДиалогВыбораФайла.ПолноеИмяФайла = ?(РежимВыгрузки, ИмяФайлаВыгрузки, ИмяФайлаЗагрузки);	
	ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайлаЗагрузки;
	ДиалогВыбораФайла.Фильтр = "Формат загрузки(*.csv)|*.csv|Все файлы (*.*)|*.*";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ИмяФайлаЗагрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПартияПриИзмененииНаСервере()
	
	Объект.НомерНакладной = Объект.Партия.НомерНакладной;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПартияПриИзменении(Элемент)
	ПартияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПартияОчисткаНаСервере()
	Объект.НомерНакладной = "";
КонецПроцедуры

&НаКлиенте
Процедура ПартияОчистка(Элемент, СтандартнаяОбработка)
	ПартияОчисткаНаСервере();
КонецПроцедуры


#КонецОбласти 


#Область ОбработкаКомманд

&НаСервере
Процедура ПрочитатьФайлНаСервере()
	
	// чтение файла
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	
	Попытка
		ЗагружаемыйФайл.Прочитать(ИмяФайлаЗагрузки);
	Исключение
		Ош = ОписаниеОшибки();
		Возврат;
	КонецПопытки;
	
	ТЗ_РезультатЗагрузкиФайла = РеквизитФормыВЗначение("РезультатЗагрузкиФайла");
	
	МассивРеквизитовУд = Новый Массив;
	
	//Удалим ранее созданные колонки в ТЗ    
	Для Каждого Колонка Из ТЗ_РезультатЗагрузкиФайла.Колонки Цикл
		МассивРеквизитовУд.Добавить("РезультатЗагрузкиФайла." + Колонка.Имя);        
	КонецЦикла;
	ИзменитьРеквизиты(,МассивРеквизитовУд);
	
	//Удалим отображение таблицы на форме и создадим новую
	ЭлементТаблица = Элементы.Найти("РезультатЗагрузкиФайла");
	Если ЭлементТаблица <> Неопределено Тогда
		Элементы.Удалить(ЭлементТаблица);        
	КонецЕсли;     
	
	ЭлементТаблица = Элементы.Добавить("РезультатЗагрузкиФайла",Тип("ТаблицаФормы"), Элементы.ГруппаРезультат);
	ЭлементТаблица.ПутьКДанным = "РезультатЗагрузкиФайла";
	ЭлементТаблица.Отображение = ОтображениеТаблицы.Список;
	
	
	Таблица = Новый ТаблицаЗначений;
	
	Шапка = ЗагружаемыйФайл.ПолучитьСтроку(1);
	
	//раскладываем строку в массив
	МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Шапка, ";");
	
	//генерируем колонки
	НомерКолонкиЧисло = 0;
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		
		//ИмяБезПробелов = СтрЗаменить(ИмяКолонки, " ",""); 
		//ИмяБезПробелов = СтрЗаменить(ИмяБезПробелов, ".","_"); 		
		//ИмяБезПробелов = СокрЛП(ИмяБезПробелов);
		НомерКолонкиЧисло = НомерКолонкиЧисло + 1;
		ИмяБезПробелов = "Колонка_" + Строка(НомерКолонкиЧисло);
		
		МассивТипов = Новый Массив;
		//МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
		МассивТипов.Добавить(Тип("Строка"));
		ПараметрыСтроки = Новый КвалификаторыСтроки(100);
		
		ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , ПараметрыСтроки);
		
		Таблица.Колонки.Добавить(ИмяБезПробелов, ДопустимыеТипы, ИмяКолонки);
		
	КонецЦикла;
	
	Для НомерСтроки = 2 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
		//ОбработкаПрерыванияПользователя();
		
		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка, ";");
		НоваяСтрока = Таблица.Добавить();
		
		Если МассивКолонок.Количество() <> Таблица.Колонки.Количество() Тогда
			// Сообщить("Ошибка со строкой " + Строка);
			Продолжить; // скорее всего в тексте содержит разделитель
		КонецЕсли;
		
		Для НомерКолонки = 1 по МассивКолонок.Количество() Цикл
			//заполняем строку значениями
			ТекущееЗначение = МассивКолонок[НомерКолонки-1];
			ИмяКолонки = Таблица.Колонки[НомерКолонки-1].Имя;
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;
		КонецЦикла;
		
		
	КонецЦикла;
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "РезультатЗагрузкиФайла"));
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.РезультатЗагрузкиФайла);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "РезультатЗагрузкиФайла." + Колонка.Имя;
		НовыйЭлемент.Ширина = 10;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Таблица, РезультатЗагрузкиФайла);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Комаында)
	ПрочитатьФайлНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонвертироватьПиловочникНаСервере()
	
	Если РезультатЗагрузкиФайла.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет данных для конвертации!";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли; 
	
	КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиловочник;
	Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(КатегорияНоменклатуры);
	
	Объект.Пиловочник.Очистить();
	
	Листвиница = Справочники.Породы.НайтиПоКоду("000000004");
	
	Для каждого стрЗагрузка Из РезультатЗагрузкиФайла Цикл
		
		НоваяСтрока = Объект.Пиловочник.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.КатегорияНоменклатуры = КатегорияНоменклатуры;  		
		
		НоваяСтрока.Порода = РфпПолучениеДанныхСервер.ПородаПоСортировке(стрЗагрузка["Колонка_6"]);
		НоваяСтрока.Сорт   = РфпПолучениеДанныхСервер.СортПоСортировке(стрЗагрузка["Колонка_7"]);
		  			
		ДлинаРасчет = Число(стрЗагрузка["Колонка_10"]);			
		ДлинаФакт = Число(стрЗагрузка["Колонка_9"]);
		
		//Для ЕЛИ:
		//Длина от 3,75 до 3,95 – считаем как 3,8 метра
		//Длина от 4,0 до 4,50 – считаем как 4,0 метра
		//Для ЛЦ:
		//Длина до 3,99 считается как несоответствие по длине. 
		//Длина от 4,0 до 4,29 – считаем как 4,0 метра
		//Длина от 4,30 до 4,60 – считаем как 4,3 метра
		//Длина от 5,1 до 5,30 – считаем как 5,2 метра
		
		
		Если НоваяСтрока.Порода = Листвиница Тогда
			
			Если ДлинаФакт <= 369 Тогда				
				ДлинаРасчет = 365;
			ИначеЕсли ДлинаФакт <= 399 Тогда
				ДлинаРасчет = 380;
			ИначеЕсли ДлинаФакт <= 429 Тогда
				ДлинаРасчет = 400;
			ИначеЕсли ДлинаФакт <= 460 Тогда
				ДлинаРасчет = 430;
			Иначе
				ДлинаРасчет = 520;
			КонецЕсли; 
		
		Иначе
			
			Если ДлинаФакт <= 369 Тогда				
				ДлинаРасчет = 365;
			ИначеЕсли ДлинаФакт <= 395 Тогда
				ДлинаРасчет = 380;
			Иначе
				ДлинаРасчет = 400;
			КонецЕсли; 
			
		КонецЕсли; 
						
		НоваяСтрока.Длина = Справочники.Длины.НайтиПоРеквизиту("ДлинаММ", ДлинаРасчет * 10, , КатегорияНоменклатуры);  		 			
		НоваяСтрока.ДлинаРасчет = ДлинаРасчет;			
		НоваяСтрока.ДлинаФакт = ДлинаФакт;
		
		Попытка			
			НоваяСтрока.ДиаметрВершиныФакт = Число(стрЗагрузка["Колонка_11"]); 			
		Исключение			
			//ОписаниеОшибки()
		КонецПопытки;
		
		Попытка			
			ДиаметрВершиныБезКоры = Число(стрЗагрузка["Колонка_21"]); 			
		Исключение			
			//ОписаниеОшибки()
		КонецПопытки;
		
		НоваяСтрока.ВычетНаКору = НоваяСтрока.ДиаметрВершиныФакт - ДиаметрВершиныБезКоры; 			
			
		ДатаДляРассчета = ?(ЗначениеЗаполнено(Объект.ДатаСмены), Объект.ДатаСмены, ТекущаяДата());
					
		//Если НоваяСтрока.ВычетНаКору = 0 И  ДатаДляРассчета > '20190820' Тогда	// на сортировке бревно было уже без коры.					
		//	БезВычетаНаКору = Истина;
		//	НоваяСтрока.ДиаметрВершиныФакт = ДиаметрВершиныБезКоры; 
		//Иначе
		//	БезВычетаНаКору = Ложь;	
		//	НоваяСтрока.ДиаметрВершиныФакт = ДиаметрВершиныБезКоры + ВычетНаКору;			
		//КонецЕсли;		
		//
		//НоваяСтрока.Сечение = РфпПолучениеДанныхСервер.ПривестиСечениеКОУ(НоваяСтрока.ДиаметрВершиныФакт, ДатаДляРассчета, БезВычетаНаКору);
		
		НоваяСтрока.Сечение = РфпПолучениеДанныхСервер.ПривестиСечениеКОУ(ДиаметрВершиныБезКоры, ДатаДляРассчета, Истина);
		НоваяСтрока.ДиаметрВершиныРасчет = НоваяСтрока.Сечение.ДиаметрММ;
		
		
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурникуПоСвойствам(НоваяСтрока.Длина, НоваяСтрока.Сечение);
		
		
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьПиловочник(Команда)
	КонвертироватьПиловочникНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеСканераНаСервере()
	
	Объект.Пиловочник.Очистить();

	ИмяСервераSQL = "10.4.12.40";
    ПользовательSQL = "sa";
    ПарольSQL = "a-vektor";
    БазаДанныхSQL = "lsort";
  	
	//Подключение к SQL-серверу
    Попытка
        Соединение  = Новый COMОбъект("ADODB.Connection");
        Команда     = Новый COMОбъект("ADODB.Command");
        Выборка     = Новый COMОбъект("ADODB.RecordSet");
        Соединение.ConnectionString =
            "driver={SQL Server};" +
            "server="+ИмяСервераSQL+";"+
            "uid="+ПользовательSQL+";"+
            "pwd="+ПарольSQL+";"+
            "database="+БазаДанныхSQL+";";
        Соединение.ConnectionTimeout = 30;
        Соединение.CommandTimeout = 600;
        //Открытие соединение
        Соединение.Open();
        Команда.ActiveConnection   = Соединение;
    Исключение
        Сообщить(ОписаниеОшибки());
        Возврат;
    КонецПопытки;
	
	//Читаем записи
	ТекстИнструкции = 
	"SELECT Dtop, Ls, Logs.SpeciesID, QualityID, PartieID, Bark, Parties.Final
	|FROM Logs LEFT JOIN Parties
    |ON Parties.ID = Logs.PartieID 
    |WHERE Parties.TTN = '" + Объект.Партия.НомерНакладной + "' AND Parties.TransportNo = '" + Объект.Партия.НомерВагона + "'";
	Попытка
	    Команда.CommandText = ТекстИнструкции;
	    Выборка = Команда.Execute();
		Если Выборка.BOF = Ложь Тогда
			
			//Массив заполнен по подядку ID в базе сканера таблица Species (список пород)	
			СоответсвиеПород = Новый Массив;
			СоответсвиеПород.Добавить(Справочники.Породы.НайтиПоКоду("000000001"));
			СоответсвиеПород.Добавить(Справочники.Породы.НайтиПоКоду("000000004"));
			СоответсвиеПород.Добавить(Справочники.Породы.НайтиПоКоду("000000003"));
			
			//Массив заполнен по подядку ID в базе сканера таблица Qualities (список сортов)
			СоответсвиеСортов = Новый Массив;
			СоответсвиеСортов.Добавить(Справочники.Сорта.НайтиПоКоду("000000003"));
			СоответсвиеСортов.Добавить(Справочники.Сорта.НайтиПоКоду("000000008"));
			СоответсвиеСортов.Добавить(Справочники.Сорта.НайтиПоКоду("000000007"));
			СоответсвиеСортов.Добавить(Справочники.Сорта.НайтиПоКоду("000000012"));
			СоответсвиеСортов.Добавить(Справочники.Сорта.НайтиПоКоду("000000011"));
			
			КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиловочник;
			Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(КатегорияНоменклатуры);	
						
			Выборка.MoveFirst();
			
			Пока Выборка.EOF = Ложь Цикл  
				
				ВремяОкончанияСортировки = Выборка.Fields("Final").Value; 			
				
				Если Не ЗначениеЗаполнено(ВремяОкончанияСортировки) Тогда  					
					Сообщить("Сортировка еще не закончена! Заполнение прервано!"); 				
					Прервать;                                                     			
				КонецЕсли;
				
				
				ДиаметрВершиныФакт		= Выборка.Fields("Dtop").Value;
				ДлинаФакт 				= Выборка.Fields("Ls").Value;
				ИдентификаторПороды 	= Выборка.Fields("SpeciesID").Value;
                ИдентификаторСорта		= Выборка.Fields("QualityID").Value;
				ТолщинаКоры				= Выборка.Fields("Bark").Value;
				
				НоваяСтрока = Объект.Пиловочник.Добавить();
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.КатегорияНоменклатуры = КатегорияНоменклатуры; 
				
				Если НЕ ЗначениеЗаполнено(ДиаметрВершиныФакт) ИЛИ НЕ ЗначениеЗаполнено(ДлинаФакт)
					ИЛИ НЕ ЗначениеЗаполнено(ИдентификаторПороды) ИЛИ НЕ ЗначениеЗаполнено(ИдентификаторСорта)
					ИЛИ НЕ ЗначениеЗаполнено(ТолщинаКоры) Тогда
					Сообщить(СтрШаблон("Ошибка в строке № %1! Не удалось получить данные со сканера. Попробуйте перезагрузить сканер или заполнить данные вручную.",НоваяСтрока.НомерСтроки));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторПороды) Тогда
					НоваяСтрока.Порода = СоответсвиеПород[ИдентификаторПороды-1]; 
				Иначе 
					Сообщить("Не удалось получить ид породы!")
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторСорта) Тогда
					Попытка
						НоваяСтрока.Сорт = СоответсвиеСортов[ИдентификаторСорта-1];    
					Исключение 
						НоваяСтрока.Сорт = Справочники.Сорта.ПустаяСсылка();
					КонецПопытки;
				Иначе
					Сообщить("Не удалось получить ид сорта!");
				КонецЕсли;
				
				
				//Данько Т. А. новая сортировка от 20241114  
				Если ЗначениеЗаполнено(ДлинаФакт) Тогда 
					//Если НоваяСтрока.Порода = Справочники.Породы.НайтиПоКоду("000000004")
					//	ИЛИ НоваяСтрока.Порода = Справочники.Породы.НайтиПоКоду("000000001")
					//	ИЛИ НоваяСтрока.Порода = Справочники.Породы.НайтиПоКоду("000000003") Тогда
						Если ДлинаФакт < 365 Тогда				
							ДлинаРасчет = 300;
						ИначеЕсли ДлинаФакт < 380 Тогда
							ДлинаРасчет = 365;
						ИначеЕсли ДлинаФакт < 405 Тогда
							ДлинаРасчет = 380;
						ИначеЕсли ДлинаФакт < 441 Тогда
							ДлинаРасчет = 400;
						ИначеЕсли ДлинаФакт < 461 Тогда 
							ДлинаРасчет = 450;
						Иначе
							ДлинаРасчет = 400; // 20241202 Данько ТА длина бревна не может быть больше 4,6 м
							// если больше скорее всего 2 бревна сканер посчитал, как 1
							// согласовали, что в таком случае присваиваем 4 м
						КонецЕсли; 	
					//Иначе 
					//	Если ДлинаФакт < 435 Тогда				
					//		ДлинаРасчет = 300;
					//	ИначеЕсли ДлинаФакт < 441 Тогда 
					//		ДлинаРасчет = 430;
					//	ИначеЕсли ДлинаФакт < 461 Тогда 
					//		ДлинаРасчет = 450;
					//	Иначе
					//		ДлинаРасчет = 400;
					//	КонецЕсли; 		
					//КонецЕсли; 
				Иначе Сообщить("Не удалось получить длину!");
					ДлинаРасчет = 0;
					ДлинаФакт = 0;
				КонецЕсли;
				//\\
				
				НоваяСтрока.ДлинаРасчет = ДлинаРасчет;			
				НоваяСтрока.ДлинаФакт = ДлинаФакт;	
				
				Если НЕ ДлинаРасчет = 0 Тогда 
					НоваяСтрока.Длина = Справочники.Длины.НайтиПоРеквизиту("ДлинаММ", ДлинаРасчет * 10, , КатегорияНоменклатуры);
				Иначе
					НоваяСтрока.Длина = Справочники.Длины.ПустаяСсылка();
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТолщинаКоры) Тогда 
					НоваяСтрока.ВычетНаКору = ТолщинаКоры; 
				Иначе Сообщить("Не удалось получить толщину коры!");
				КонецЕсли;

				ДатаДляРассчета = ?(ЗначениеЗаполнено(Объект.ДатаСмены), Объект.ДатаСмены, ТекущаяДата());
				
				Если ЗначениеЗаполнено(ДиаметрВершиныФакт) Тогда 
					НоваяСтрока.Сечение = РфпПолучениеДанныхСервер.ПривестиСечениеКОУ(ДиаметрВершиныФакт, ДатаДляРассчета, Истина);  
				Иначе Сообщить("Не удалось получить диаметр вершины!"); 
					НоваяСтрока.Сечение = Справочники.РазмерСечения.ПустаяСсылка();
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НоваяСтрока.Сечение) Тогда
					НоваяСтрока.ДиаметрВершиныРасчет = НоваяСтрока.Сечение.ДиаметрММ; 
				Иначе
					НоваяСтрока.ДиаметрВершиныРасчет = 0;
				КонецЕсли;
			
				НоваяСтрока.ДиаметрВершиныФакт = ДиаметрВершиныФакт + ТолщинаКоры;			
		
				НоваяСтрока.Количество = 1;
				НоваяСтрока.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурникуПоСвойствам(НоваяСтрока.Длина, НоваяСтрока.Сечение);
				Выборка.MoveNext();
			КонецЦикла;    
			
			//Заполнение пустых сортов			
			//Отбор = Новый Структура("Сорт", Справочники.Сорта.ПустаяСсылка());  
			//ПустыеСорта = Объект.Пиловочник.Выгрузить(Отбор);  
			//Если ЗначениеЗаполнено(ПустыеСорта) Тогда 
			//	й = 0;
			//	СортПоУмолчанию = Неопределено;
			//	Пока СортПоУмолчанию = Неопределено Цикл 
			//		Если Объект.Пиловочник[й].Сорт <> Справочники.Сорта.ПустаяСсылка() и Объект.Пиловочник[й].Сорт <> Справочники.Сорта.НайтиПоКоду("000000011") Тогда
			//			СортПоУмолчанию = Объект.Пиловочник[й].Сорт;
			//		КонецЕсли;
			//		й = й + 1;					
			//	КонецЦикла;
			//	Для каждого Строка из Объект.Пиловочник Цикл
			//		Если Строка.Сорт = Справочники.Сорта.ПустаяСсылка() Тогда
			//			Строка.Сорт = СортПоУмолчанию;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
		Иначе
			Сообщить("Нет данных для загрузки!");
		КонецЕсли;
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//Закрытие соединения
    Попытка
        Соединение.Close();
    Исключение
        Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеСканера(Команда)
	
	Если НЕ Объект.Пиловочник.Количество() = 0 Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПолученияДанныхСканера", ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
		"Перед заполнением текущие данные будут очищены. Вы уверены?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Получить данные сканера" // (необ.) заголовок
		);
		Возврат;
	КонецЕсли; 
	
	ПолучитьДанныеСканераНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПолученияДанныхСканера(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
       ПолучитьДанныеСканераНаСервере();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры


#КонецОбласти
